> Hey Aniek, thanks for the PR.
> 
> When we run this in the production environment it will destroy the current external static IP addresses and then create new external static IP addresses, which will stop the JSTOR telescope from working because the IP addresses won't exist on the whitelist. See below for an example:
> 
> ```shell
> An execution plan has been generated and is shown below.
> Resource actions are indicated with the following symbols:
>   + create
>   ~ update in-place
>   - destroy
> 
> Terraform will perform the following actions:
> 
>   # google_compute_address.airflow_main_vm_static_external_ip will be destroyed
>   - resource "google_compute_address" "airflow_main_vm_static_external_ip" {
>       - address            = "xxxx" -> null
>       - address_type       = "EXTERNAL" -> null
>       - creation_timestamp = "2021-07-19T19:58:15.887-07:00" -> null
>       - id                 = "projects/academic-observatory-dev/regions/us-west1/addresses/airflow-main-vm-static-external-ip" -> null
>       - name               = "airflow-main-vm-static-external-ip" -> null
>       - network_tier       = "PREMIUM" -> null
>       - prefix_length      = 0 -> null
>       - project            = "academic-observatory-dev" -> null
>       - region             = "us-west1" -> null
>       - self_link          = "https://www.googleapis.com/compute/v1/projects/academic-observatory-dev/regions/us-west1/addresses/airflow-main-vm-static-external-ip" -> null
>       - users              = [
>           - "https://www.googleapis.com/compute/v1/projects/academic-observatory-dev/zones/us-west1-b/instances/airflow-main-vm",
>         ] -> null
>     }
> 
>   # google_compute_address.airflow_worker_vm_static_external_ip will be destroyed
>   - resource "google_compute_address" "airflow_worker_vm_static_external_ip" {
>       - address            = "xxxx" -> null
>       - address_type       = "EXTERNAL" -> null
>       - creation_timestamp = "2021-07-19T19:58:15.403-07:00" -> null
>       - id                 = "projects/academic-observatory-dev/regions/us-west1/addresses/airflow-worker-vm-static-external-ip" -> null
>       - name               = "airflow-worker-vm-static-external-ip" -> null
>       - network_tier       = "PREMIUM" -> null
>       - prefix_length      = 0 -> null
>       - project            = "academic-observatory-dev" -> null
>       - region             = "us-west1" -> null
>       - self_link          = "https://www.googleapis.com/compute/v1/projects/academic-observatory-dev/regions/us-west1/addresses/airflow-worker-vm-static-external-ip" -> null
>       - users              = [] -> null
>     }
> 
>   # module.airflow_main_vm.google_compute_address.vm_static_external_ip[0] will be created
>   + resource "google_compute_address" "vm_static_external_ip" {
>       + address            = (known after apply)
>       + address_type       = "EXTERNAL"
>       + creation_timestamp = (known after apply)
>       + id                 = (known after apply)
>       + name               = "airflow-main-vm-static-external-ip"
>       + network_tier       = (known after apply)
>       + project            = (known after apply)
>       + purpose            = (known after apply)
>       + region             = "us-west1"
>       + self_link          = (known after apply)
>       + subnetwork         = (known after apply)
>       + users              = (known after apply)
>     }
> 
>   # module.airflow_main_vm.google_compute_instance.vm_instance will be updated in-place
>  ....
> 
> Plan: 1 to add, 1 to change, 2 to destroy.
> ```
> 
> Also, I think that this setup will mean that the external IP addresses are created and destroyed when the VMs are created and destroyed, which is not what we want to happen, because the IP addresses won't stay static. The external IP addresses need to be created / destroyed independent from the VMs.
> 
> Could you modify it so that:
> 
> * When we update the production environment the current external IP addresses aren't destroyed.
> * Either: lifecycle.prevent_destroy is set to true on production and false in other environments
> * Or: The external IP addresses are not created in develop and staging, but the external IP addresses are still created independently from the VMs.

Hi Jamie,

Yeah, some good points and it made me think about how we use the VM module from airflow as well.

I don't think the IP addresses would have been created/destroyed when the VMs are created/destroyed (or at least not in the production environment), because the prevent_destroy would prevent that.
However, this did make me think that it would be impossible to destroy the worker VM in the production environment, because I included the external IP address in the module.

I changed it so that the addresses are declared outside of the module again, the way you had it set up.
But, the external IP addresses are only created in the production environment. You can't directly set lifecycle.preven_destroy to true/false based on a variable (https://github.com/hashicorp/terraform/issues/22544). 
So this is bulletpoint 3 I believe :-).

I think updating the current production environment should then be OK and not destroy the external IP addresses, could you check with terraform plan to be sure?